twallis-cpr/proton-communication-comparison/micro_ros/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

CONFIG_MICRO_ROS_APP_STACK=16000
CONFIG_MICRO_ROS_APP_TASK_PRIO=5

# micro-ROS agent
CONFIG_MICRO_ROS_AGENT_IP="192.168.1.169"
CONFIG_MICRO_ROS_AGENT_PORT="8888"
